app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."project_id" = 1 LIMIT 1
---
  def show
    @project = Project.find(params[:id])
    @project_ideas = Idea.where("project_id = ?", params[:id])

INSERT INTO "projects" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 15 Oct 2012 12:57:31 UTC +00:00], ["description", "just a simple test"], ["title", "test1"], ["updated_at", Mon, 15 Oct 2012 12:57:31 UTC +00:00], ["user_id", 1]]
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save